---
kind: other
id: Properties.T:Autodesk.Revit.UI.Events.MessageBoxData
source: html/638bfd79-8ed8-2141-8c72-7cfa218aeb95.htm
---
# MessageBoxData Properties

An integer that describes the standard windows type of the dialog box.